Revit 2016 API
Face.HasRegions Property
Reports if the face contains regions created with the Split Face command.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public bool HasRegions { get; }
Visual Basic
Public ReadOnly Property HasRegions As Boolean
	Get
Visual C++
public:
property bool HasRegions {
	bool get ();
}
See Also
Face Class
Autodesk.Revit.DB Namespace